var store = [{
        "title": "GitHub Pages + Jekyll 本地部署博客",
        "excerpt":"前言 本博客作为我的第一篇技术博客，有些细节可能讲的不是很清晰或者有矛盾，请见谅，错误点和矛盾点可以到我的github账号或者email邮箱反馈，我会及时修正 描述 写博客时，若要查看博客更改的信息，我们得先从git提交到我们的远程github仓库，才能看到效果，还有可能提交完结果报错，运行不起来，最后还得回退，及其的麻烦，于是我通过询问AI，找到这么一个方法让我们能直接在本地运行我们的blog，保存代码后直接刷新即可看到最新效果，及其方便，好了教程开始 教程 第一步：准备环境 1、安装Ruby,可以去到其官网（https://rubyinstaller.org/downloads/），直接下载最新的Ruby+Devkit 安装时注意： 1、勾选上 Run ‘ridk install’（自动安装 MSYS2） 2、打开后选择：1 → Enter（安装基础组件） 验证是否成功： ruby -v gem -v 如果能显示版本，说明 OK。 第二步：安装Jekyll与Bundler 执行： gem install bundler jekyll 成功后检查： jekyll -v 第三步：安装依赖 1、先进入到本地博客根目录 2、在上面文件路径窗口里面输入cmd打开此位置的命令窗 或者先win+R打开运行，输入cmd 打开命令窗后先输入E：（主要看你项目在哪个盘）切换盘符 再使用cd E:\\ITEM\\taciturn-hg.github.io（取决于你的项目绝对路径）进入项目根目录 3、如果项目里面有Gemfile文件，则在命令窗执行 bundle install 如果没有，则需自行在项目根目录创建文件Gemfile，内容示例： source \"https://gems.ruby-china.com/\" gem \"jekyll\", \"~&gt; 4.3.2\" gem...","categories": [],
        "tags": ["技术"],
        "url": "/2025/11/30/GitHubPages+Jekyll%E6%9C%AC%E5%9C%B0%E9%83%A8%E7%BD%B2%E5%8D%9A%E5%AE%A2/",
        "teaser": null
      },{
        "title": "我的第一篇博客",
        "excerpt":"欢迎来到我的博客  ok啊，大家好，我是后果，目前是一名民办大二计科专业的学生，热衷于学习编程，同时也想找到志同道合的朋友一起学习，一起进步。     正文  现在是2025-11-30 21:37，我终于整好这个博客开始写了，天知道这玩意搞了我一下午，调这博客主题还有本地部署博客真是挺闹腾，用那AI也是一直跟我绕，整半天没整好，不过还得是靠我的聪明才智，成功把这玩意整好了。   好了说正事，首先这是我的第一篇日常博客，聊聊我想说的，首先很庆幸能遇到我团队里的某一位，这一切的开始都是源于ta，ta是我大学认识的第一个朋友，还跟我同寝室，ta很强，我都是以ta为目标，ta在大一给了我很强的学习动力，如果没认识ta，那我跟我的恩师也只是停留在专业课老师和同学的关系，而我也会跟大部分大学生一样浑浑噩噩的混完这四年，虽然说现在我技术上稍比ta强，但ta身上还是有很多我需要学习的地方，为人处世这块哈哈。   其次就是感谢带我的恩师，从最开始就跟我们讲明了未来我们可以走的方向，帮我拓宽了视野，让我看清了很多东西，让我的前行路上的迷雾散了不少，同时呢，恩师给了我们很多建议，打比赛啊，考证啊，我只能说，帮助很大，后续偶尔的聚餐聊天，聊发展，聊未来，我就在畅想未来我通过努力奋斗之后站在高处的感觉，虽然不知道能不能爬上去，不过想那么多干啥，写到这里让我想到《功夫熊猫》里面乌龟大师的话：“Yesterday is history, Tomorrow is a mystery, But today is a gift. That is why it’s called the present”，就像那贪心算法，每一次的选择都是最优，最后大概率就是最优答案，注重当下，做好每一天。   我呢，希望今天成为一切正式的开始，后面能不断的发展下去，也希望未来的我，不管是发展的好或坏，看到这第一篇博客时，能回想起这一刻，能继续激励或重新振作自己，能回想起第一次成功提交，成功运行时的兴奋，加油吧，别放弃！     结语  好了，就讲这么多，后续我是打算在博客里面记录我的学习、做项目时候遇到的新东西，可以方便我随时查看、复习巩固，也可以分享给跟我同一团队的伙伴，也希望能帮助到每一位看我博客的人，若发现有问题，可到我的github账号或者email邮箱告诉我，我会及时修改。  ","categories": [],
        "tags": ["日常"],
        "url": "/2025/11/30/%E6%88%91%E7%9A%84%E7%AC%AC%E4%B8%80%E7%AF%87%E5%8D%9A%E5%AE%A2/",
        "teaser": null
      }]
